app/controllers/api/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "abc@abc.com"], ["LIMIT", 1]]
---
  def verify_email_db
    @user = User.find_by(email: params[:email])