app/models/user.rb

  def reset_session_token!
    self.session_token = User.generate_session_token
    self.save!
---
INSERT INTO "users" ("username", "email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "nihtQTGKpGuPvuaPS9gHUA"], ["updated_at", "2019-02-27 06:45:11.737251"], ["id", 1]]

  def password=(pw)
    @password = pw
    self.password_digest = BCrypt::Password.create(pw)
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"